{
  "lessonTasks": [
    {
      "benefit from": "to use or enjoy something as much as possible",
      "carry out": "to do or complete something, especially that you have said you would do",
      "end up": "to reach a particular place or achieve a situation after other activities",
      "make the most of": "to do something that is advantageous or good",
      "pick up": "to learn something by watching or listening to other people",
      "pop up": "to appear or happen, especially suddenly or unexpectedly",
      "set off": "to start a journey",
      "take the plunge": "to decide to do something important or risky, especially after thinking about it for a long time",
      "thrive on sth": "to enjoy or be successful in a particular situation, especially one that other people find difficult or unpleasant",
      "turn up": "to arrive or appear somewhere, usually unexpectedly or in a way that was not planned"
    },
    {
      "The phrase 'to take the plunge' means...": "to make a big decision, often with risk",
      "... means making the most of one's life.": "make the most of",
      "You want to thrive ... a new culture.": "on",
      "To carry out your work, you need ...": "a stable network and a laptop",
      "I think people can’t benefit ... challenges.": "from",
      "When I have a flight, I always set ... early.": "off",
      "When you live in another country, you can really soak ... a new culture.": "up",
      "Once you get lost and end up ...": "in an unfamiliar place"
    },
    {
      "to feel over the moon": "to feel extremely happy",
      "to feel homesick": "to miss home and feel nostalgic",
      "to be charmed by": "to be pleasantly attracted or enchanted by something",
      "to experience a feeling of euphoria": "to feel an intense sense of happiness and excitement",
      "to feel overwhelmed": "to feel emotionally overloaded or unable to handle a situation",
      "to adjust to smth": "to get used to or adapt to a new situation or environment",
      "to find one’s way": "to navigate or become comfortable in a new place or situation",
      "to settle in somewhere": "to become comfortable in a new place or situation",
      "to become familiar with sth": "to get to know or understand something better",
      "to embrace the culture / rule": "to accept and integrate into a new culture or rule"
    },
    {
      "The honeymoon stage": "Feeling excited and fascinated with the new environment, seeing everything as positive",
      "The frustration stage": "Feeling irritated or overwhelmed by cultural differences, struggling to adapt",
      "The adjustment stage": "Starting to understand and accept cultural differences, feeling more comfortable",
      "The acceptance stage": "Fully integrating into the new culture, seeing differences as just a part of life"
    },
    {
      "Have you ever ... to learn a new skill or subject in a short period of time?": "had",
      "... you have to meet specific deadlines in your job or studies?": "Did",
      "... you ever had to deal with a challenging customer or client?": "Have",
      "... you got any recommendations for must-see attractions in a particular city?": "Have",
      "Have you ... any strategies for dealing with jet lag when travelling across time zones?": "got",
      "Have you ever ... the opportunity to volunteer or work abroad?": "had",
      "... you have a memorable experience during your last trip?": "Did",
      "What are some things that you have ... do before going on a trip?": "had to",
      "Have you ever ... to make a difficult decision? What was it?": "had",
      "Have you ... a valid passport to travel internationally?": "got",
      "Have you ... travelling to different countries recently?": "been",
      "Have you ever ... a language barrier while travelling in a foreign country?": "had",
      "... you ever had a delay or cancellation during your travels?": "Have",
      "Have you applied for a visa? Where to? What documents ... you have to prepare?": "do"
    },
    {
      "Dmytro Komarov is known for...": "Exploring remote and exotic locations in his travel show",
      "In Brazil, Dmytro had a dangerous encounter with...": "Venomous snakes, crocodiles, and a near-drowning experience",
      "What unique cultural experience did Dmytro have in China?": "He immersed himself in local traditions and tried unique cuisine, including medusa",
      "Who did Dmytro meet in Japan?": "A Yakuza boss, learning about Japan's underworld traditions",
      "What traditional method did Dmytro witness in Indonesia?": "The ancient technique of oil extraction and snake craftsmanship"
    },
    {
      "Despite the obstacles my mom ___ faced, she managed to build a successful career as a lawyer.": "had",
      "___ anyone seen my passport?": "Have",
      "Stephen King ___ working hard to achieve his goals and dreams this year.": "has been",
      "With all that wealth and possessions, she still ___ the one thing she truly wants in life.": "hasn't got",
      "Dmytro Komarov ___ never experienced such an overwhelming feeling of joy before he travelled to Asia.": "has",
      "To become a professional traveller, you ___ have a lot of money.": "have to",
      "___ you ever thought about travelling to space?": "Have",
      "Jane ___ buy her tickets by Friday, or she can’t join us.": "has to",
      "Well, I ___ time for you today, see you tomorrow!": "haven't got"
    },
    {
      "I've just ___ the most amazing idea! Let’s go to Paris this weekend!": "come up with",
      "Watching TV shows all night before an early job interview is ___.": "a terrible idea",
      "The idea of starting my own business ___ in my sleep. I was so excited when I woke up.": "came to me",
      "Personally, I think opening a low-cost airline in Ukraine is ___.": "a brilliant idea",
      "Sofia forgot to ___, so she couldn’t remember it the next day.": "write the idea down",
      "When I was in Japan, I came across a ticket machine that accepts plastic bottles as payment! What ___!": "an innovative idea",
      "A lot of people credit Alexander Graham Bell for inventing the telephone, but some still believe that he ___ this idea from Antonio Meucci.": "stole",
      "If Bonnie were ___, she would accept mine.": "open to ideas",
      "The Prime Minister had wonderful ideas on improving the infrastructure, but all of them ___.": "got rejected",
      "Slavik just got himself ___ car! I’ve seen it. Looks awesome! Good for him.": "a brand new"
    },
    {
      "___ you allergic to any food? – Yes, I can’t eat seafood.": "Are",
      "After watching only one episode of this show, I ___ it completely.": "was hooked on",
      "Because of the terrible ___, I was tossing and turning all night.": "cough",
      "Does your godmother suffer from ___ in spring?": "hay fever",
      "Anyone can have ___. It’s okay not to be okay.": "psychological issues",
      "I succeeded in ___. I don’t smoke or eat junk food anymore.": "kicking my bad habits",
      "If you have a drug ___ in your family, don’t give up on them*. Sometimes they don’t know how to ask for help.": "addict",
      "Ukrainians tend to ___ and, as a result, ___ during holidays.": ["overeat", "put on weight"],
      "William ___ for pneumonia. He won’t be at work for two weeks.": "has taken sick leave",
      "We were forced to ___ the other day because our granny wasn’t feeling well.": "call an ambulance",
      "Why doesn’t he ___ A and C for his skin?": "take vitamins"
    },
    {
      "Appear": "Turn up",
      "Say something louder": "Speak up",
      "Learn more about": "Find out",
      "Write down": "Put down",
      "Look for information in a dictionary, on the Internet, in a book etc.": "Look something up",
      "Create, think of": "Make something up / Come up with",
      "Seem": "Come across as",
      "Postpone a meeting till later": "Put the interview off",
      "Relax": "Calm down",
      "Wear nice clothes": "Dress up"
    }
  ]
}
